# GetTaggedElementIds Method (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
IndependentTag..::..GetTaggedElementIds Method
IndependentTag Class See Also
---
Returns a set of LinkElementId for all tagged elements, if any. A LinkElementId will be provided for each subelement that is being referenced by the tag.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2022
# Syntax
C#
---
```text
public ICollection<LinkElementId> GetTaggedElementIds()
```

Visual Basic
---
```text
Public Function GetTaggedElementIds As ICollection(Of LinkElementId)
```

Visual C++
---
```text
public:
ICollection<LinkElementId^>^ GetTaggedElementIds()
```

# Remarks
All the returned LinkElementIds will be valid even when IsOrphaned is true.
# See Also
IndependentTag Class
Autodesk.Revit.DB Namespace